haiku/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @poem = Poem.find(params[:poem_id])
    @comment.user = @current_user
    @comment.poem = @poem
    if @comment.save
---
SELECT "poems".* FROM "poems" WHERE "poems"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("comment_content", "poem_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment_content", "this is good."], ["poem_id", 2], ["user_id", 2], ["created_at", "2020-04-14 18:43:30.087366"], ["updated_at", "2020-04-14 18:43:30.087366"]]