haiku/app/controllers/poems_controller.rb

SELECT "poems".* FROM "poems"
---
  def index
    @poems = Poem.all

INSERT INTO "poems" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "test123"], ["user_id", 1], ["created_at", "2020-04-13 18:58:47.031880"], ["updated_at", "2020-04-13 18:58:47.031880"]]
---
  def create
    @poem = Poem.new(poem_params)

    if @poem.save

UPDATE "poems" SET "content" = $1, "updated_at" = $2 WHERE "poems"."id" = $3  [["content", "Feel the cold wind! whip, No warm sad between my toes, The waves crash with chills"], ["updated_at", "2020-04-14 19:31:26.101723"], ["id", 2]]
---
  def update
    if @poem.update(poem_params)

SELECT "poems".* FROM "poems" WHERE "poems"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_poem
      @poem = Poem.find(params[:id])